{
  "education": "Education",
  "university": "Hunan University - Mathematics and Applied Mathematics",
  "duration": "Duration: September 2017 - June 2021",
  "courses": "Key Courses: Advanced Algebra, Advanced Mathematics, Partial Differential Equations",
  "gpa": "GPA: 3.8/4.0, multiple school-level scholarships",
  "skills": "Skills",
  "languages": "Programming Languages: Java, Python, JavaScript",
  "frameworks": "Frameworks and Technologies: Spring Boot, Django, Vue.js",
  "databases": "Databases: MySQL, PgSQL, Oracle, GaussDB",
  "middleware": "Middleware: Redis, Kafka, Elasticsearch",
  "tools": "Tools & Platforms: Git, Docker, Jenkins, K8s, SVN",
  "work": "Work Experience",
  "company": "Company: Huawei Technologies Co., Ltd.",
  "position": "Position: Software Development Engineer",
  "employment_duration": "Duration: August 2021 - Present",
  "responsibilities": "Responsibilities: Participated in back-end development for multiple projects, handling module design, coding, and testing.",
  "projects": "Projects",
  "project1_title": "Project 1: Huawei ERP Core Trading System",
  "project2_title": "Project 2: Huawei Wallet",
  "project1_details": [
    "Development Time: July 2021 - March 2023",
    "Responsibilities and Achievements:",
    "1. Implemented DDD agile development to ensure stable project iterations and launches",
    "2. Organized 100+ code reviews for 20+ developers, identified 200+ quality issues",
    "3. To address the challenges of large transaction volumes, extensive wide table content, and slow generation during monthly and annual closing periods, ClickHouse + Flink was adopted to achieve integrated stream and batch processing, summarizing transaction data and enhancing transaction performance from 30 minutes to 30 seconds.",
    "4. APM and Grafana monitoring tools were introduced to visualize thread count, CPU usage, and other data during container operation. Once issues such as OOM were detected, headDump files were downloaded for analysis and handling.",
    "5. OpenResty was utilized to build an API gateway through the combination of Nginx and Lua scripts",
    "6. Redis and Caffeine caching middleware were introduced to improve system concurrency efficiency",
    "7. Led the project to upgrade from VUE2 to VUE3."
  ],
  "project2_details": [
    "Development Time: March 2023 - Present",
    "Responsibilities and Achievements:",
    "1. Developed front-end and back-end functionalities including product display, coupon handling, order processing, and integration with third-party services",
    "2. Design a cache queue model to address inventory concurrency issues, increasing the concurrency from 500 to about 10,000",
    "3. Use Python to select external and internal large models for prompt debugging, and provide AI product search, AI recommendation and other functions"
  ]
}
